#+Title: Funcoes

* preparativos :noexport:
  
  #+name docker run mssqlserver
  #+begin_src sh
    docker run --name sqlserver -v $(pwd)/sql_scripts/:/sql_scripts -e 'ACCEPT_EULA=Y' -e 'SA_PASSWORD=Aluno#123' -p 1433:1433 -d microsoft/mssql-server-linux && docker logs sqlserver  
  #+end_src

  #+RESULTS:


    #+name: create_database
    #+begin_src sh :results output replace  :exports both
      docker exec sqlserver /opt/mssql-tools/bin/sqlcmd -S localhost -U SA -P Aluno#123 -i /sql_scripts/create_database.sql
    #+end_src

    #+RESULTS: create_database
    : DATABASE_NAME                                                                                                                    DATABASE_SIZE REMARKS                                                                                                                                                                                                                                                       
    : -------------------------------------------------------------------------------------------------------------------------------- ------------- --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    : lojainfo                                                                                                                                 16384 NULL                                                                                                                                                                                                                                                          
    : master                                                                                                                                    6592 NULL                                                                                                                                                                                                                                                          
    : model                                                                                                                                    16384 NULL                                                                                                                                                                                                                                                          
    : msdb                                                                                                                                     15808 NULL                                                                                                                                                                                                                                                          
    : tempdb                                                                                                                                   16384 NULL                                                                                                                                                                                                                                                          


* Introdução Funções

  Boas fontes pra estudar functions e que nós usamos para compor esse
  material
  https://www.w3schools.com/sql/sql_ref_sqlserver.asp

  Tipos
  *Escalares*: Sempre retornam apenas um valor
  *Inline Table-Valued*:Retornam multiplos valores
  *Multi-Statement Table-Valued*:
  

* Apresetação de algumas funções importantes

  #+name: aula_funcoes
  #+begin_src sh :results output replace  :exports both
     docker exec sqlserver /opt/mssql-tools/bin/sqlcmd -S localhost -U SA -P Aluno#123 -i /sql_scripts/aula_funcoes.sql
  #+end_src
  #+RESULTS: aula_funcoes
  #+begin_example
  ########BASICAO DE VARIAVEIS

  -----------
            0

  (1 rows affected)

  -----------
            1

  (1 rows affected)
  ===================================
  ########FUNCAO CHARINDEX
  CHARINDEX: bicicle

  -----------
           48

  (1 rows affected)
  CHARINDEX: are

  -----------
           12

  (1 rows affected)
  CHARINDEX: ARE

  -----------
           12

  (1 rows affected)
  CHARINDEX: Ref

  -----------
            1

  (1 rows affected)
  CHARINDEX: ect

  -----------
            5

  (1 rows affected)
  =================================================================
  ########FUNCAO CONCAT
  Result                        
  ------------------------------
  Happy Birthday 11/25          

  (1 rows affected)
  =================================================================
  ########FUNCAO TRIM

  -----------------------------------------------------
  Five spaces are at the beginning of this string.     
  Five spaces are at the beginning of this string.     
  Five spaces are at the beginning of this string.     
  Five spaces are at the beginning of this string.     
  Five spaces are at the beginning of this string.     

  (5 rows affected)
  =================================================================
  ########FUNCAO REPLACE

  --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  abxxxfghixxx                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    

  (1 rows affected)
  =================================================================
  ########FUNCAO STRING

  ------
   123.5

  (1 rows affected)
  =================================================================
  ########FUNCAO CEILING

  --------------------- --------------------- ---------------------
               124.0000             -123.0000                 .0000

  (1 rows affected)
  =================================================================
  ########FUNCAO FLOOR

  ------- ------- ---------------------
      123    -124              123.0000

  (1 rows affected)
  =================================================================
  ########FUNCOES DATA

  -----------
         2018

  (1 rows affected)
  ######## CRIANDO FUNCAO
  funcao escalar

  -----------
            3

  (1 rows affected)
  #+end_example

  script na íntegra...
  #+INCLUDE: ./sql_scripts/aula_funcoes.sql src sql


* Mostrar Nome e Endereço de todos os clientes (func Concat)
    
* Qual o valor médio dos itens vendidos?
** Primeiro precisamos de todos itens vendidos
  #+name: select * from tb_vendas_itens
  #+begin_src sh :results output replace  :exports both
    docker exec sqlserver /opt/mssql-tools/bin/sqlcmd -S localhost -U SA -P Aluno#123 -Q 'use lojainfo; select * from tb_vendas_itens'
  #+end_src

  #+RESULTS: select * from tb_vendas_itens
  #+begin_example
  Changed database context to 'lojainfo'.
  id_item     id_venda    id_hardware qtde_item   total_item
  ----------- ----------- ----------- ----------- ----------
            1           3           4          10     600.50
            2           3           5          10    3005.00
            3           3           6          10    1050.00
            4           3           7          10     809.00
            5           3           8          10    3002.00
            6           4           4           1      60.50
            7           4           5           1     300.50
            8           4           6           1     105.00
            9           4           7           1      80.90
           10           4           8           1    3002.00

  (10 rows affected)
  #+end_example

  #+name: select avg(total_item) from tb_vendas_itens 
  #+begin_src sh :results output replace  :exports both
    docker exec sqlserver /opt/mssql-tools/bin/sqlcmd -S localhost -U SA -P Aluno#123 -Q 'use lojainfo; select avg(total_item) from tb_vendas_itens'
  #+end_src

  #+RESULTS: select avg(total_item) from tb_vendas_itens
  : Changed database context to 'lojainfo'.
  :                                         
  : ----------------------------------------
  :                              1201.540000
  : 
  : (1 rows affected)



** Temos que arredondar (Funcao AVG e Round)
   https://docs.microsoft.com/pt-br/sql/t-sql/functions/round-transact-sql
   ROUND ( numeric_expression , length [ ,function ] )  

  #+name: select round(avg(total_item),2,1) from tb_vendas_itens
  #+begin_src sh :results output replace  :exports both
    docker exec sqlserver /opt/mssql-tools/bin/sqlcmd -S localhost -U SA -P Aluno#123 -Q 'use lojainfo; select round(avg(total_item),2) from tb_vendas_itens'
  #+end_src

  #+RESULTS: select round(avg(total_item),2,1) from tb_vendas_itens
  : Changed database context to 'lojainfo'.
  :                                         
  : ----------------------------------------
  :                              1201.540000
  : 
  : (1 rows affected)



** Pera ai tem que tirar esses zeros(Função Cast)
   https://docs.microsoft.com/pt-br/sql/t-sql/functions/cast-and-convert-transact-sql
   O problema é que double no sqlserver usa 6 zeros.
   Em geral o pessoal tira esses zeros no front end
   Mas dá pra transformar em string e depois sim tirar os zeros
   O float usa 2
  #+name: select cast(round(avg(total_item),2,1) as float) from tb_vendas_itens'
  #+begin_src sh :results output replace  :exports both
  docker exec sqlserver /opt/mssql-tools/bin/sqlcmd -S localhost -U SA -P Aluno#123 -Q 'use lojainfo; select cast(round(avg(total_item),2,1) as float) from tb_vendas_itens'
  #+end_src

  #+RESULTS: select cast(round(avg(total_item),2,1) as float) from tb_vendas_itens'
  : Changed database context to 'lojainfo'.
  :                         
  : ------------------------
  :                  1201.54
  : 
  : (1 rows affected)



* Conferir se todos os clientes tem um email valido
  Vamos considerar por enquanto que tendo um @  e que esse @ nao sendo
  o primeiro caractere já tá bom... blz?
  #+name: select email from tb_clientes
  #+begin_src sh :results output replace  :exports both
    docker exec sqlserver /opt/mssql-tools/bin/sqlcmd -S localhost -U SA -P Aluno#123 -Q 'use lojainfo; select email, charindex("@", email) from tb_clientes'
  #+end_src

  #+RESULTS: select email from tb_clientes
  : Changed database context to 'lojainfo'.
  : email                                                                             
  : ---------------------------------------------------------------------- -----------
  : jef@dom.com                                                                      4
  : carlos@dom.com                                                                   7
  : ralf@dom.com                                                                     5
  : 
  : (3 rows affected)

  
* Apresentar estatística de gastos dos clientes (Func Avg, Sum) :noexport:
** que tal começar com lista de clientes e o id de cada compra que eles fizeram?
  #+name: select * from tb_clientes
  #+begin_src sh :results output replace  :exports both
  docker exec sqlserver /opt/mssql-tools/bin/sqlcmd -S localhost -U SA -P Aluno#123 -Q 'use lojainfo; select vdas.id_cliente, vdas.id_venda  from tb_vendas as vdas'
  docker exec sqlserver /opt/mssql-tools/bin/sqlcmd -S localhost -U SA -P Aluno#123 -Q 'use lojainfo; select cli.id_cliente, cli.nome from tb_clientes as cli'
  docker exec sqlserver /opt/mssql-tools/bin/sqlcmd -S localhost -U SA -P Aluno#123 -Q 'use lojainfo; select cli.id_cliente, cli.nome, vda.id_venda from tb_clientes as cli right join tb_vendas as vda on cli.id_cliente = vda.id_cliente'
  docker exec sqlserver /opt/mssql-tools/bin/sqlcmd -S localhost -U SA -P Aluno#123 -Q 'use lojainfo; select cli.id_cliente, cli.nome, vda.id_venda from tb_clientes as cli right join tb_vendas as vda on cli.id_cliente = vda.id_cliente'
  #+end_src

  eu tenho duas vendas, uma pro cli 2 e uma pro cli 3
  realmente so o cli 2 fez alguma compra, ou seja, tem venda so pro
  cli 2
  #+RESULTS: select * from tb_clientes
  #+begin_example
  Changed database context to 'lojainfo'.
  id_cliente  id_venda   
  ----------- -----------
            2           3
            3           4

  (2 rows affected)
  Changed database context to 'lojainfo'.
  Name                                                                                                                             Owner                                                                                                                            Type                            Created_datetime       
  -------------------------------------------------------------------------------------------------------------------------------- -------------------------------------------------------------------------------------------------------------------------------- ------------------------------- -----------------------
  tb_vendas                                                                                                                        dbo                                                                                                                              user table                      2018-03-07 03:38:29.807


  Column_name                                                                                                                      Type                                                                                                                             Computed                            Length      Prec  Scale Nullable                            TrimTrailingBlanks                  FixedLenNullInSource                Collation                                                                                                                       
  -------------------------------------------------------------------------------------------------------------------------------- -------------------------------------------------------------------------------------------------------------------------------- ----------------------------------- ----------- ----- ----- ----------------------------------- ----------------------------------- ----------------------------------- --------------------------------------------------------------------------------------------------------------------------------
  id_venda                                                                                                                         int                                                                                                                              no                                            4 10    0     no                                  (n/a)                               (n/a)                               NULL                                                                                                                            
  id_cliente                                                                                                                       int                                                                                                                              no                                            4 10    0     no                                  (n/a)                               (n/a)                               NULL                                                                                                                            
  data                                                                                                                             date                                                                                                                             no                                            3 10    0     no                                  (n/a)                               (n/a)                               NULL                                                                                                                            
  vlr_total                                                                                                                        decimal                                                                                                                          no                                            5 8     2     no                                  (n/a)                               (n/a)                               NULL                                                                                                                            
  desconto                                                                                                                         decimal                                                                                                                          no                                            5 8     2     yes                                 (n/a)                               (n/a)                               NULL                                                                                                                            
  vlr_pago                                                                                                                         decimal                                                                                                                          no                                            5 8     2     yes                                 (n/a)                               (n/a)                               NULL                                                                                                                            

  Identity                                                                                                                         Seed                                     Increment                                Not For Replication
  -------------------------------------------------------------------------------------------------------------------------------- ---------------------------------------- ---------------------------------------- -------------------
  id_venda                                                                                                                                                                1                                        1                   0

  RowGuidCol                                                                                                                      
  --------------------------------------------------------------------------------------------------------------------------------
  No rowguidcol column defined.                                                                                                   

  Data_located_on_filegroup                                                                                                       
  --------------------------------------------------------------------------------------------------------------------------------
  PRIMARY                                                                                                                         

  index_name                                                                                                                       index_description                                                                                                                                                                                                  index_keys                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    
  -------------------------------------------------------------------------------------------------------------------------------- ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  PK__tb_venda__4595B5AB7EBF0644                                                                                                   clustered, unique, primary key located on PRIMARY                                                                                                                                                                  id_venda                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      

  constraint_type                                                                                                                                                                                                                                                  constraint_name                                                                                                                  delete_action update_action status_enabled status_for_replication constraint_keys                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               
  ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- -------------------------------------------------------------------------------------------------------------------------------- ------------- ------------- -------------- ---------------------- --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  PRIMARY KEY (clustered)                                                                                                                                                                                                                                          PK__tb_venda__4595B5AB7EBF0644                                                                                                   (n/a)         (n/a)         (n/a)          (n/a)                  id_venda                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      

  No foreign keys reference table 'tb_vendas', or you do not have permissions on referencing tables.
  No views with schema binding reference table 'tb_vendas'.

  Changed database context to 'lojainfo'.
  id_cliente  nome                                              
  ----------- --------------------------------------------------
            3 Jeferson                                          
            4 Carlos                                            
            5 Ralf                                              

  (3 rows affected)
  Changed database context to 'lojainfo'.
  id_cliente  nome                                               id_venda   
  ----------- -------------------------------------------------- -----------
         NULL NULL                                                         3
            3 Jeferson                                                     4

  (2 rows affected)
  Changed database context to 'lojainfo'.
  id_cliente  nome                                               id_venda   
  ----------- -------------------------------------------------- -----------
         NULL NULL                                                         3
            3 Jeferson                                                     4

  (2 rows affected)
  #+end_example



  
